import numpy as np  #导入numpy调用np
x = np.arange(12)   # 含有0-11共12个数
x
x.shape   # 访问形状
x.size    # 访问大小
X = x.reshape(3, 4) #改变一个张量的形状而不改变元素数量和元素值，把张量x从形状为（12,）的行向量转换为形状为（3,4）的矩阵
X
np.zeros((2, 3, 4)) #创建一个形状为（2,3,4）的张量，其中所有元素都设置为0
np.ones((2, 3, 4)) #创建一个形状为（2,3,4）的张量，其中所有元素都设置为1
np.random.normal(0, 1,size = (3, 4)) #创建一个形状为（3,4）的张量,每个元素都从均值为0、标准差为1的标准高斯分布（正态分布）中随机采样
np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]) #创建并赋予确定值

x = np.array([1, 2, 4, 8])
y = np.array([2, 2, 2, 2])
x + y, x - y, x * y, x / y, x ** y  # **运算符是求幂运算
np.exp(x) #求幂

X = np.arange(12).reshape(3, 4)
Y = np.array([[2, 1, 4, 3], [1, 2, 3, 4], [4, 3, 2, 1]])
np.concatenate([X, Y], axis=0), np.concatenate([X, Y], axis=1) #多个张量连结，沿行和沿列
X == Y #同或，相同为1，不同为0

X.sum() #对张量中的所有元素进行求和，会产生一个单元素张量

#广播机制，先补空位再运算，沿着数组中长度为1的轴进行广播（行为1复制行，列为1复制列）
a = np.arange(3).reshape(3, 1)
b = np.arange(2).reshape(1, 2)
a + b

X[-1], X[1:3] #可以用[-1]选择最后一个元素，可以用[1:3]选择第二个和第三个元素，实际是[start,end)

X[1, 2] = 9 #通过指定索引来将元素写入矩阵,索引为1,2,坐标为2行3列
X[0:2, :] = 12 #访问第1行和第2行，：代表沿轴1所有元素，赋值为12

Z = np.zeros_like(Y) #创建一个新的矩阵Z，其形状与另一个Y相同， 使用zeros_like来分配一个全0的块
print('id(Z):', id(Z))
Z[:] = X + Y
print('id(Z):', id(Z))
